SISTEMA_EL_TERNURIN/sistema_el_ternurin/app/Controllers/Home.php

    public function insertar_juguete()
    {
        $request = \Config\Services::request();
        $nombre = $request->getVar('nombre');

        if (!empty($nombre)) {
            $db = \Config\Database::connect();
            $data = [
                'nombre' => $nombre
            ];

            if ($db->table('producto')->insert($data)) {
---
INSERT INTO `producto` (`nombre`) VALUES ('Talleres Salvà S.A.')

    public function insertar_proveedor()
    {
        $request = \Config\Services::request();
        $nombre_proveedor = $request->getVar('nombre_proveedor');
        $nombre_empresa = $request->getVar('nombre_empresa');

        if (!empty($nombre_proveedor) &&!empty($nombre_empresa)) {
            $db = \Config\Database::connect();

            // Insertar proveedor
            $data_proveedor = [
                'empresa_proveedora' => $nombre_proveedor
            ];
            $db->table('proveedores')->insert($data_proveedor);

            // Insertar empresa
            $data_empresa = [
                'empresa_proveedora' => $nombre_empresa
            ];
            $db->table('proveedores')->insert($data_empresa);
---
INSERT INTO `proveedores` (`empresa_proveedora`) VALUES ('Banco NP S.L.N.E')
INSERT INTO `proveedores` (`empresa_proveedora`) VALUES ('Nelson, Stevenson and Hudson')