API_JUGUETES/api/app/Models/JugueteModel.php

SELECT "nombre", "descripcion", "categoria", "precio", "cantidad_disponible"
FROM "juguete"
WHERE "nombre" = 'a'
---
    public function getJuguetePorNombre(){
        $request = request();
        $nombre = $request->getGet('nombre');
        $db = db_connect();
        $sql = $db->table('juguete')
        ->select('nombre,descripcion,categoria,precio,cantidad_disponible')
        ->where('nombre', $nombre);

        $query = $sql->get();

SELECT "nombre", "fecha_salida"
FROM "coleccion"
WHERE "producto" = '5'
---
    public function getColeccionesPorJuguete($id){
        $db = db_connect();
        $sql = $db->table('coleccion')
            ->select('nombre, fecha_salida')
            ->where('producto', $id);

        $query = $sql->get();

SELECT "nombre"
FROM "juguete"
---
    public function obtener_juguetes(){
        $db = db_connect();
        $sql = $db->table('juguete')
        ->select('nombre');
        $query = $sql->get();