API_PROVEEDORES/api/app/Models/EmpresaModel.php

SELECT "e"."nombre"
FROM "empresa" "e"
JOIN "repartidor" "r" ON "e"."id" = "r"."empresa_empleadora"
WHERE CONCAT(r.nombre, ' ', r.apellido_paterno, ' ', r.apellido_materno) = 'Henry Johnson Poole'
---
    public function obtener_nombre_empresa(){
        $request = request();
        $nombre = $request->getGet('nombre');
        $db = db_connect();

        $sql = $db->table('empresa e')
        ->select('e.nombre','e.precio_envio')
        ->join('repartidor r', 'e.id = r.empresa_empleadora')
        ->where("CONCAT(r.nombre, ' ', r.apellido_paterno, ' ', r.apellido_materno)",$nombre);

        $query = $sql->get();

SELECT "entrega"."id", "empresa"."nombre" AS "nombre_empresa"
FROM "entrega"
JOIN "repartidor" ON "entrega"."repartidor_encargado" = "repartidor"."id"
JOIN "empresa" ON "repartidor"."empresa_empleadora" = "empresa"."id"
WHERE CONCAT(repartidor.nombre, ' ', repartidor.apellido_paterno, ' ', repartidor.apellido_materno) = 'Powers PLC'
---
    public function obtener_entregas_repartidor(){
        $request = request();
        $nombre = $request->getGet('nombre');
        $db = db_connect();

        $sql = $db->table('entrega')
        ->select('entrega.id, empresa.nombre AS nombre_empresa')
        ->join('repartidor', 'entrega.repartidor_encargado = repartidor.id')
        ->join('empresa', 'repartidor.empresa_empleadora = empresa.id')
        ->where("CONCAT(repartidor.nombre, ' ', repartidor.apellido_paterno, ' ', repartidor.apellido_materno)", $nombre);
        $query = $sql->get();

SELECT "entrega"."id"
FROM "entrega"
JOIN "repartidor" ON "entrega"."repartidor_encargado" = "repartidor"."id"
JOIN "empresa" ON "repartidor"."empresa_empleadora" = "empresa"."id"
WHERE "empresa"."nombre" = 'Fowler-Proctor'
AND "entrega"."status" = TRUE
---
    public function obtener_entregas_hechas_por_empresa(){
        $request = request();
        $nombre = $request->getGet('nombre');
        $db = db_connect();

        $sql = $db->table('entrega')
        ->select('entrega.id', 'entrega.status', 'CONCAT(repartidor.nombre, " ", repartidor.apellido_paterno, " ", repartidor.apellido_materno) AS nombre_repartidor')
        ->join('repartidor', 'entrega.repartidor_encargado = repartidor.id')
        ->join('empresa', 'repartidor.empresa_empleadora = empresa.id')
        ->where('empresa.nombre', $nombre)
        ->where('entrega.status', true);

        $query = $sql->get();